In [136]:
import sqlite3
import pandas as pd

In [142]:
conn = sqlite3.connect('db.sqlite3')
cursor = conn.cursor()

In [138]:
filepath = 'C:/Users/jangi/Desktop/Carnot/datasheets.xls'
student_fields = ['student_id', 'first_name', 'last_name', 'email', 'gender', 'school', 'books']
school_fields = ['region', 'school_name', 'email', 'principal_name', 'phone', 'address']
book_fields = ['title', 'author_name', 'date_of_publication', 'number_pages']

student_db = pd.read_excel(filepath, sheet_name='Students', header=None, skiprows=1, index_col=None, names=student_fields)
school_db = pd.read_excel(filepath, sheet_name='Schools', header=None, skiprows=1, index_col=None, names=school_fields)
books_db = pd.read_excel(filepath, sheet_name='Books', header=None, skiprows=1, index_col=None, names=book_fields)

books_db.insert(0, 'book_id', books_db.index)
school_db.insert(0, 'school_id', school_db.index)

school_dict = {k: v for k, v in school_db[['school_name', 'school_id']].values.tolist()}
book_dict = {k: v for k, v in books_db[['title', 'book_id']].values.tolist()}



student_db['school_id'] = student_db['school'].map(school_dict).astype(pd.Int64Dtype())
student_db['books_id'] = student_db['books'].map(book_dict).astype(pd.Int64Dtype())
student_db = student_db.drop(columns = ['school', 'books'])


# student_db = student_db.drop(columns=['student_id'])
# books_db = books_db.drop(columns=['book_id'])
# school_db = school_db.drop(columns=['school_id'])

In [139]:
student_db.head()

,first_name,last_name,email,gender,school_id,books_id
0,Andy,Fullegar,afullegar0@wsj.com,Female,2,1
1,Lucy,Olifard,lolifard1@macromedia.com,NaN,9,2
2,Brianne,Reaman,breaman2@clickbank.net,NaN,5,<NA>
3,Lorrie,Fison,lfison3@nationalgeographic.com,Male,6,4
4,Alyss,Harcombe,aharcombe4@toplist.cz,Female,4,5

In [140]:
student_db.to_sql('StudentApp_student', conn, if_exists='replace', index=False)
school_db.to_sql('StudentApp_school', conn, if_exists='replace', index=False)
books_db.to_sql('StudentApp_book', conn, if_exists='replace', index=False)

10

In [141]:
cursor.close()
conn.close()

In [24]:
cursor.execute('delete from StudentApp_school')

In [8]:
cursor.execute('drop table Student')
cursor.execute('drop table School')
cursor.execute('drop table Book')

In [39]:
cursor.close()

In [40]:
conn.close()

In [28]:
cursor.execute('SELECT * FROM StudentApp_student').fetchall()

[]